Revit 2026 API

# TextBoxDataImage Property

---

The image of the TextBox.

**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public ImageSource Image { get; set; }
```
```vb
Public Property Image As ImageSource
	Get
	Set
```
```cpp
public:
property ImageSource^ Image {
	ImageSource^ get ();
	void set (ImageSource^ value);
}
```
```fsharp
member Image : ImageSource with get, set
```

#### Property Value

ImageSource

The image will be shown on the left side of the item. The best size is 16 x 16 pixels.

#### Reference

TextBoxData Class

Autodesk.Revit.UI Namespace